Repository: adslbarxatov/Thousand
Catalog: src/Thousand_*.resx
Languages: ru_ru

# HelpText
source: Game “Thousand” The game uses 5 dice. Each player takes turns rolling the dice. If all or part of the dice form a combination, the player may optionally roll all or the remainder of the dice respectively again. Only after all the dice have taken part in the combinations, they can all be rolled again. Each roll brings points (for each roll they are counted separately), which are accumulated until the player saves them. Unsaved points are burned if some roll didn’t give any combinations. When saving points or when they burn out, the turn passes to the next player. The game continues until one of the players gets exactly 1000 points. Combinations that allow you to perform an additional roll: — one “one” +10 points; — one “five” +5 points; — two “ones” +20 points; — two “fives” +10 points; — three “ones” +100 points; — three “twos” +20 points; — three “threes” +30 points; — three “fours” +40 points; — three “fives” +50 points; — three “sixes” +60 points; — four “ones” +200 points; — four “twos” +40 points; — four “threes” +60 points; — four “fours” +80 points; — four “fives” +100 points; — four “sixes” +120 points; — five “ones” +1000 points; — five “twos” +200 points; — five “threes” +300 points; — five “fours” +400 points; — five “fives” +500 points; — five “sixes” +600 points; — “one”, “two”, “three”, “four” and “five” +150 points; — “two”, “three”, “four”, “five” and “six” +250 points. It should be noted that if the sum of the saved and current points exceeds 1000, the current points are also burned. In addition, there are so-called “casks” in the game (in the app they’re indicated on the scales from above by red areas). These are the cases where the points saved are in one of the following ranges: 0 to 100 (not including 100), 300 to 400 (not including 400), or 700 to 800 (not including 800). In these cases, the dice must be rolled until the sum of points leaves these ranges. Blue scales allow you to navigate with the “casks”, indicating where the player will be relative to them if he saves points. The yellow bars show the points already saved. Keyboard: [F1] – call help; [F2] – change the interface language; [F5] – select the first player; [F12] – exit the game; Hold [Space] – shuffle the dice; Release [Space] – roll the dice; [Enter] – save current points
ru_ru: Игра «Тысяча» Для игры используются 5 игральных кубиков. Каждый игрок по очереди бросает кубики. Если все или часть кубиков формируют некоторую комбинацию, игрок может по желанию бросить все или оставшуюся часть кубиков соответственно ещё раз. Только после того, как все кубики поучаствовали в комбинациях, их можно все бросать заново. Каждый бросок приносит очки (для каждого броска они считаются отдельно), которые накапливаются до того как игрок не сохранит их. Несохранённые очки сгорают, если какой-то бросок не дал никаких комбинаций. При сохранении очков или при их сгорании ход переходит к следующему игроку. Игра продолжается до получения одним из игроков ровно 1000 очков. Комбинации, позволяющие выполнить дополнительный бросок: — одна единица +10 очков; — одна пятёрка +5 очков; — две единицы +20 очков; — две пятёрки +10 очков; — три единицы +100 очков; — три двойки +20 очков; — три тройки +30 очков; — три четвёрки +40 очков; — три пятёрки +50 очков; — три шестёрки +60 очков; — четыре единицы +200 очков; — четыре двойки +40 очков; — четыре тройки +60 очков; — четыре четвёрки +80 очков; — четыре пятёрки +100 очков; — четыре шестёрки +120 очков; — пять единиц +1000 очков; — пять двоек +200 очков; — пять троек +300 очков; — пять четвёрок +400 очков; — пять пятёрок +500 очков; — пять шестёрок +600 очков; — единица, двойка, тройка, четвёрка и пятёрка +150 очков; — двойка, тройка, четвёрка, пятёрка и шестёрка +250 очков. Следует отметить, что, если сумма сохранённых и текущих очков превышает 1000, текущие очки также сгорают. Кроме того, в игре существуют так называемые «бочки» (в программе указаны на шкалах сверху красными областями). Это – те случаи, когда сохранённые очки находятся в одном из следующих диапазонов: от 0 до 100 (не включая 100), от 300 до 400 (не включая 400) или от 700 до 800 (не включая 800). В этих случаях кубики нужно бросать до тех пор, пока сумма очков не покинет эти диапазоны. Ориентироваться с «бочками» позволяют синие шкалы, указывающие, где относительно них окажется игрок, если сохранит очки. Жёлтые шкалы показывают уже сохранённые очки. Клавиатура: [F1] – вызвать справку; [F2] — изменить язык интерфейса; [F5] — выбрать первого игрока; [F12] — выйти из игры; Удерживать [Пробел] — перемешивать кости; Отпустить [Пробел] – бросить кости; [Enter] — сохранить текущие точки

# FinishGame
source: Finish the game?
ru_ru: Завершить игру?

# GetHelp
source: &Help
ru_ru: &Справка

# Cask
source: , you’re in a cask. Roll further
ru_ru: , Вы в бочке. Бросайте дальше

# FailedThrow1
source: {0:S}, this roll failed.
ru_ru: {0:S}, этот бросок не удался.

# FailedThrow2
source: Well, {0:S}, it happens.
ru_ru: Ну, {0:S}, бывает и так.

# FailedThrow3
source: , you’re overkill.
ru_ru: , у вас перебор.

# PlayerDefaultName
source: Player
ru_ru: Игрок

# PlayerWon
source: Player {0:S} won!
ru_ru: Игрок {0:S} победил!

# PointsSaved
source: , your points are saved.
ru_ru: , Ваши очки сохранены.

# SaveOrTryAgain
source: , you can keep the points or risk again
ru_ru: , Вы можете сохранить очки или рискнуть ещё раз

# SaveOrTryAgainExt
source: . But {0:D} points are not lying on the road!
ru_ru: . Но {0:D} очков на дороге не валяются!

# ThrowDice
source: , roll the dice
ru_ru: , бросайте кости

# FirstStatus
source: We need to determine who will roll the dice first
ru_ru: Нужно определить, кто будет бросать кости первым

# SaveScoresButton
source: &Save scores
ru_ru: &Оставить очки

# ThrowDiceButton
source: &Roll the dice
ru_ru: &Бросить кости

# WhoIsFirstButton
source: &Who is first?
ru_ru: &Кто первый?
